In [1]:
import configparser

import configparser
import psycopg2

In [2]:
config = configparser.ConfigParser()
config.read("dwh.cfg")
host     = config.get("CLUSTER","HOST")
DB_NAME  = config.get("CLUSTER","DB_NAME")
DB_USER  = config.get("CLUSTER","DB_USER")
DB_PASS  = config.get("CLUSTER","DB_PASSWORD")
DB_PORT  = config.get("CLUSTER","DB_PORT")
IAM_ROLE = config.get("IAM_ROLE","ARN")

In [10]:
conn = psycopg2.connect(
           host = host,
           database = DB_NAME,
           user = DB_USER,
           password = DB_PASS,
           port = DB_PORT)
cur = conn.cursor()

In [11]:
cur.execute("select count(*) from songplay")
row = cur.fetchall()

In [14]:
print(row[0][0])

319

In [15]:
%load_ext sql

In [17]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER,DB_PASS, host, DB_PORT,DB_NAME)
print(conn_string)
%sql $conn_string

postgresql://awsuser:Hm33481968@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev

'Connected: awsuser@dev'

In [19]:
%sql select * from songplay limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(205, datetime.datetime(2018, 11, 5, 1, 58, 24), 44, 'paid', 'SOHMNPP12A58A7AE4B', 'ARKZ13R1187FB54FEE', 237, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (18, datetime.datetime(2018, 11, 5, 10, 41, 2), 42, 'paid', 'SOCNCGL127D9786D66', 'AREHK7O1187B9ADDD7', 129, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (225, datetime.datetime(2018, 11, 5, 11, 14), 44, 'paid', 'SOCDOVE12AB01808DE', 'ARYE9E71187B9AA1B3', 269, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (176, datetime.datetime(2018, 11, 5, 14, 24, 56), 44, 'paid', 'SOTETAR12AF72A5FF7', 'AROR8OB1187FB50D6A', 269, 'Waterloo-Cedar Falls, IA', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (165, datetime.datetime(2018, 11, 5, 14, 39, 43), 91, 'free', 'SOODHLO12AF72A1980', 'ARNLVQB1187B9AEAB0', 90, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.2; WOW64; Trident/6.0)')]

In [20]:
%sql select * from songs limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('SOBLFFE12AF72AA5BA', 'Scream', 'ARJNIUY12298900C91', 2009, 213.9424),
 ('SOLAGMD12A6D4FD30C', 'Hundulu', 'ARYKSY51187B9B6216', 2009, 488.69832),
 ('SOSPLRJ12A6D4F807C', 'Love The Way You Do So', 'ARIPXFO1187B9ACFF9', 1995, 403.1473),
 ('SOEQUFB12AB0180B9B', 'Lonesome Boatman', 'ARMZC8L1187B9A52CB', 1992, 308.34893),
 ('SOMUUNK12AB0183AEE', 'Seaweed', 'ARIRBKB1187FB56CD0', 2004, 218.95791)]

In [23]:
%sql select * from artists where latitude is not null limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('ARWYVP51187B98C516', 'The Suicide Machines', 'Detroit, MI', '42.331679999999999', '-83.047920000000005'),
 ('ARBBHDX1187B9B2EE7', 'Godflesh', 'Birmingham, England', '52.478589999999997', '-1.9086000000000001'),
 ('ARUB0K61187B9B9AC3', 'Hot Water Music', 'Gainesville, FL', '29.651949999999999', '-82.323179999999994'),
 ('ARTL0JQ1187FB4D190', 'Air Supply', 'Melbourne, Australia', '-37.817529999999998', '144.96715'),
 ('AR571EH1187B98F500', 'Mortiis', 'Notodden, Norway', '59.56465', '9.2677300000000002')]

In [24]:
%sql select * from users limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[('53', 'Celeste', 'Williams', 'F', 'free'),
 ('10', 'Sylvie', 'Cruz', 'F', 'free'),
 ('83', 'Stefany', 'White', 'F', 'free'),
 ('80', 'Tegan', 'Levine', 'F', 'free'),
 ('44', 'Aleena', 'Kirby', 'F', 'paid')]

In [25]:
%sql select * from time limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(datetime.datetime(2018, 11, 1, 20, 57, 10), 20, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 1, 22, 23, 14), 22, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 1, 30, 41), 1, 2, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 9, 13, 37), 9, 2, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 9, 16, 16), 9, 2, 44, 11, 2018, 5)]

In [28]:
%sql select * from staging_songs limit 5

 * postgresql://awsuser:***@redshift-cluster-1.cthgeymvuc72.us-west-2.redshift.amazonaws.com:5439/dev
5 rows affected.

[(1, 'ARBZIN01187FB362CC', '1.32026', '103.78870999999999', '27', 'Paris Hilton', 'SOERIDA12A6D4F8506', 'I Want You (Album Version)', 192.28689, 2006),
 (1, 'ARKIQCZ1187B9A7C7C', '52.239739999999998', '-0.88575999999999999', 'Northampton, Northamptonshire, En', 'Bauhaus', 'SOSIJKW12A8C1330E3', 'A God In An Alcove (Session Version)', 248.65914, 0),
 (1, 'ARQVORN11F50C4EFEC', None, None, '', 'Bedlight For Blue Eyes', 'SOMFRKT12A8C146C67', 'Without You', 165.38077, 0),
 (1, 'AR7WK5411A348EF5EA', '48.856920000000002', '2.3412099999999998', 'PARIS - NANTES', 'Minitel Rose', 'SOTCOTZ12A8C136BCB', 'Elevator', 248.31955, 2008),
 (1, 'AR0IT221187B999C4D', '50.501010000000001', '4.4768400000000002', 'BELGIUM', 'The Weathermen', 'SOFJPHQ12A6D4FBA32', 'Let Them Come To Berlin', 246.17751, 0)]